In [1]:
import pandas as pd

In [4]:
prev_week_df = pd.read_csv(r'C:\Python_Vignesh\ML_Exercises\JNB_data\emp_prev_week.csv')

In [6]:
curr_week_df = pd.read_csv(r'C:\Python_Vignesh\ML_Exercises\JNB_data\emp_cur_week.csv')

In [9]:
prev_week_df

   emp_id   emp_name  salary
0       1    Vignesh    1000
1       2  Shankaran    2000
2       3     Sachin    5000
3       4      Rahul   10000

In [10]:
curr_week_df

   emp_id   emp_name  salary
0       1    Vignesh    1000
1       2  Shankaran   20000
2       4      Rahul   10000
3       5      Rohit    7000

In [11]:
resigned_emp_id= set(prev_week_df.emp_id) - set(curr_week_df.emp_id)
resigned_emp_id

{3}

In [12]:
resigned_employee_df = prev_week_df[prev_week_df.emp_id.isin(resigned_emp_id)]
resigned_employee_df

   emp_id emp_name  salary
2       3   Sachin    5000

In [13]:
newly_added_emp_id= set(curr_week_df.emp_id) -  set(prev_week_df.emp_id) 
newly_added_emp_id

{5}

In [14]:
new_employee_df = curr_week_df[curr_week_df.emp_id.isin(newly_added_emp_id)]
new_employee_df

   emp_id emp_name  salary
3       5    Rohit    7000

In [7]:
combined_df = prev_week_df.merge(curr_week_df, how= 'outer')

In [8]:
combined_df

   emp_id   emp_name  salary
0       1    Vignesh    1000
1       2  Shankaran    2000
2       3     Sachin    5000
3       4      Rahul   10000
4       2  Shankaran   20000
5       5      Rohit    7000

In [25]:
value_counts = combined_df.emp_id.value_counts() > 1
df_val_counts = pd.DataFrame(value_counts)
df_value_counts_reset = df_val_counts.reset_index()
df_value_counts_reset

   emp_id  count
0       2   True
1       1  False
2       3  False
3       4  False
4       5  False

In [33]:
modified_emp_list = set(df_value_counts_reset[df_value_counts_reset['count'] == True].emp_id)

In [34]:
modified_emp_list

{2}

In [35]:
combined_df[combined_df['emp_id'].isin(modified_emp_list)]

   emp_id   emp_name  salary
1       2  Shankaran    2000
4       2  Shankaran   20000

In [36]:
curr_week_df[curr_week_df['emp_id'].isin(modified_emp_list)]

   emp_id   emp_name  salary
1       2  Shankaran   20000